# RebarInSystem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem Class
Members See Also
---
Represents a rebar element that is part of a system.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class RebarInSystem : Element
```

Visual Basic
---
```text
Public Class RebarInSystem _
	Inherits Element
```

Visual C++
---
```text
public ref class RebarInSystem : public Element
```

# Remarks
A RebarInSystem element is part of another element, the "system", which controls most of its properties. The system elements are AreaReinforcement and PathReinforcement. Only a few properties of RebarInSystem are modifiable. Otherwise, the appearance and behavior of RebarInSystem elements is identical to Rebar elements. RebarInSystem elements may be converted to Rebar elements by removing the system element.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..RebarInSystem
# See Also
RebarInSystem Members
Autodesk.Revit.DB.Structure Namespace